      *programmer name: Gabriel Sanchez
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUM-OF-ODD-NUM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  ITE5_USER_INPUT_N          PIC 9(3).
       01  ITE5_USER_INPUT_M          PIC 9(3).
       01  ITE5_STORE_SUM             PIC 9(3).
       01  ITE5_COUNTER               PIC 9(3).
       01  ITE5_SUM_OUT               PIC Z(3).

       PROCEDURE DIVISION.
           MOVE 0 TO ITE5_STORE_SUM.
           DISPLAY "PLEASE INSERT A NUMBER: " WITH NO ADVANCING.
           ACCEPT ITE5_USER_INPUT_N.

           DISPLAY "PLEASE INPUT ANOTHER NUMBER: " WITH NO ADVANCING.
           ACCEPT ITE5_USER_INPUT_M.

           MOVE ITE5_USER_INPUT_N TO ITE5_COUNTER.

           PERFORM UNTIL ITE5_COUNTER > ITE5_USER_INPUT_M
               IF FUNCTION MOD(ITE5_COUNTER, 2) IS NOT EQUAL TO 0
                   ADD ITE5_COUNTER TO ITE5_STORE_SUM
               END-IF
               ADD 1 TO ITE5_COUNTER
           END-PERFORM.
           
           MOVE ITE5_STORE_SUM TO ITE5_SUM_OUT.
           DISPLAY "SUM OF ODD NUMBERS: " ITE5_SUM_OUT.

           STOP RUN.
