      *programmer name: Gabriel Sanchez
       IDENTIFICATION DIVISION.
       PROGRAM-ID. GENERATE-BINARY.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  ITE10_USER_INPUT          PIC 9(6).
       01  ITE10_USERINT_OUT         PIC ZZZ,ZZ9.
       01  ITE10_PLACE_VALUE         PIC 9(20) value 1.
       01  ITE10_UI_REMAINDER        PIC 9(2).
       01  ITE10_CALC_INPUT          PIC 9(20) value 0.
       01  ITE10_STORE_BINARY        PIC Z(20).



       PROCEDURE DIVISION.
           MOVE 0 TO ITE10_USER_INPUT.
           MOVE 0 TO ITE10_STORE_BINARY.
           MOVE 1 TO ITE10_PLACE_VALUE.
           DISPLAY "PLEASE INPUT A DECIMAL NUMBER: " WITH NO ADVANCING.
           ACCEPT ITE10_USER_INPUT.
           MOVE ITE10_USER_INPUT TO ITE10_USERINT_OUT.

           DISPLAY "DECIMAL: " ITE10_USERINT_OUT.
           PERFORM UNTIL ITE10_USER_INPUT = 0
               COMPUTE ITE10_UI_REMAINDER = 
-                  FUNCTION MOD(ITE10_USER_INPUT, 2)
               COMPUTE ITE10_CALC_INPUT = 
-                  ITE10_CALC_INPUT + (ITE10_UI_REMAINDER 
-                  * ITE10_PLACE_VALUE)
               COMPUTE ITE10_PLACE_VALUE = ITE10_PLACE_VALUE * 10
               COMPUTE ITE10_USER_INPUT = ITE10_USER_INPUT / 2
           END-PERFORM.

           MOVE ITE10_CALC_INPUT TO ITE10_STORE_BINARY.
           
           DISPLAY "BINARY: " ITE10_STORE_BINARY.

           STOP RUN.
