      *programmer name: Gabriel Sanchez 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EVEN-ODD.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SEL3_USER_INPUT_IN           PIC 9(3).
       01  SEL3_USER_INPUT_OUT          PIC Z(3).

       PROCEDURE DIVISION.
           DISPLAY "PLEASE INPUT A NUMBER: " WITH NO ADVANCING.
           ACCEPT SEL3_USER_INPUT_IN.
           MOVE SEL3_USER_INPUT_IN TO SEL3_USER_INPUT_OUT.

           IF FUNCTION MOD(SEL3_USER_INPUT_IN, 2) = 0
               DISPLAY SEL3_USER_INPUT_OUT WITH NO ADVANCING " IS EVEN"
           ELSE 
               DISPLAY SEL3_USER_INPUT_OUT WITH NO ADVANCING " IS ODD"
           END-IF.
           STOP RUN.
