      *programmer name: Gabriel Sanchez 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVISED-SALESMAN-INFO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SEL8_SM_NUM                 PIC 9(12).
       01  SEL8_SM_NAME                PIC X(25).
       01  SEL8_UNIT_SOLD              PIC 9(7)V99.
       01  SEL8_UNIT_PRICE             PIC 9(7)V99.
       01  SEL8_SOLVE_SALES            PIC 9(7)V99.
       01  SEL8_SALES_OUT              PIC Z(7).99.
       01  SEL8_SOLVE_COMMISSION       PIC 9(7)V99.
       01  SEL8_COMMISSION_OUT         PIC Z(7).99.
      

       PROCEDURE DIVISION.
           DISPLAY "PLEASE ENTER NUMBER: " WITH NO ADVANCING.
           ACCEPT SEL8_SM_NUM.

           DISPLAY "PLEASE ENTER NAME: " WITH NO ADVANCING.
           ACCEPT SEL8_SM_NAME.

           DISPLAY "PLEASE ENTER UNITS SOLD: " WITH NO ADVANCING.
           ACCEPT SEL8_UNIT_SOLD.

           DISPLAY "PLEASE ENTER UNIT PRICE: " WITH NO ADVANCING.
           ACCEPT  SEL8_UNIT_PRICE.

           COMPUTE SEL8_SOLVE_SALES = SEL8_UNIT_SOLD * SEL8_UNIT_PRICE.
           MOVE SEL8_SOLVE_SALES TO SEL8_SALES_OUT.
           DISPLAY "TOTAL SALES: " SEL8_SALES_OUT.
           
           EVALUATE TRUE
           WHEN SEL8_SOLVE_SALES <= 15000
               COMPUTE SEL8_SOLVE_COMMISSION = SEL8_SOLVE_SALES * .15
               MOVE SEL8_SOLVE_COMMISSION TO SEL8_COMMISSION_OUT
               DISPLAY "WITH 15% COMMISSION AMOUNTING TO: " 
-                  SEL8_COMMISSION_OUT
           WHEN SEL8_SOLVE_SALES <= 20000
               COMPUTE SEL8_SOLVE_COMMISSION = SEL8_SOLVE_SALES * .20
               MOVE SEL8_SOLVE_COMMISSION TO SEL8_COMMISSION_OUT
               DISPLAY "WITH 20% COMMISSION AMOUNTING TO: " 
-                  SEL8_COMMISSION_OUT
           WHEN SEL8_SOLVE_SALES <= 25000
               COMPUTE SEL8_SOLVE_COMMISSION = SEL8_SOLVE_SALES * .25
               MOVE SEL8_SOLVE_COMMISSION TO SEL8_COMMISSION_OUT
               DISPLAY "WITH 25% COMMISSION AMOUNTING TO: " 
-                  SEL8_COMMISSION_OUT
           WHEN SEL8_SOLVE_SALES <= 30000
               COMPUTE SEL8_SOLVE_COMMISSION = SEL8_SOLVE_SALES * .30
               MOVE SEL8_SOLVE_COMMISSION TO SEL8_COMMISSION_OUT
               DISPLAY "WITH 30% COMMISSION AMOUNTING TO: " 
-                  SEL8_COMMISSION_OUT
           WHEN SEL8_SOLVE_SALES > 30000
               COMPUTE SEL8_SOLVE_COMMISSION = SEL8_SOLVE_SALES * .40
               MOVE SEL8_SOLVE_COMMISSION TO SEL8_COMMISSION_OUT
               DISPLAY "WITH 40% COMMISSION AMOUNTING TO: " 
-                  SEL8_COMMISSION_OUT
           END-EVALUATE.

           STOP RUN.
