       FD SQNC1-FILE.
       01  SQNC1_RECORD.
           05 SQNC1_FH_NAME    PIC X(30).

       FD SQNC2-FILE.

       01  SQNC2_RECORD.
           05  SEQ2_numA_FH     PIC 9(2) VALUE 10.
           05  SEQ2_numB_FH     PIC 9(2) VALUE 5.
           05  SEQ2_numC_FH     PIC Z(2).

       