      *programmer name: Gabriel Sanchez 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CEL-FAHRENHEIT.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SEQ4_CELCIUS        PIC S9(5)v99.
       01  SEQ4_FAHRENHEIT     PIC S9(5)v99.
       01  SEQ4_F_OUT          PIC ZZ,ZZZ.99.


       PROCEDURE DIVISION.
           DISPLAY "PLEASE INPUT SEQ4_CELCIUS: " WITH NO ADVANCING.
           ACCEPT SEQ4_CELCIUS.

           COMPUTE SEQ4_FAHRENHEIT = (SEQ4_CELCIUS * 9 / 5) + 32.
           MOVE SEQ4_FAHRENHEIT TO SEQ4_F_OUT.
           DISPLAY "CONVERTED TO SEQ4_FAHRENHEIT: " SEQ4_F_OUT.
           STOP RUN.
