            *programmer name: Gabriel Sanchez 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SALES-MAN-INFO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SEQ5_SALES_MAN_NUM     PIC 9(12).
       01  SEQ5_SALES_MAN_NAME    PIC X(25).
       01  SEQ5_UNIT_SOLD         PIC 9(5).
       01  SEQ5_UNIT_PRICE        PIC 9(5)v99.
       01  SEQ5_STORE_TOTAL_SALES PIC $ZZ,ZZ9.

       PROCEDURE DIVISION.
           DISPLAY "PLEASE INPUT NAME: " WITH NO ADVANCING.
           ACCEPT SEQ5_SALES_MAN_NAME.

           DISPLAY "PLEASE INPUT NUM: " WITH NO ADVANCING.
           ACCEPT SEQ5_SALES_MAN_NUM.

           DISPLAY "PLEASE INPUT UNITS SOLD: " WITH NO ADVANCING.
           ACCEPT SEQ5_UNIT_SOLD.

           DISPLAY "PLEASE INPUT UNIT PRICE: " WITH NO ADVANCING.
           ACCEPT SEQ5_UNIT_PRICE.

           COMPUTE SEQ5_STORE_TOTAL_SALES = 
-              SEQ5_UNIT_SOLD * SEQ5_UNIT_PRICE.
           DISPLAY "TOTAL SALES: " SEQ5_STORE_TOTAL_SALES.
           
           STOP RUN.
