      *Programmer Name: Gabriel Sanchez
       IDENTIFICATION DIVISION.
       PROGRAM-ID. AREA-CIRCUM-CIRCLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SEQ9_PI              PIC 9(1)V99 VALUE 3.14.
       01  SEQ9_DIAMETER        PIC 9(4).
       01  SEQ9_RADIUS          PIC 9(4)V99.
       01  SEQ9_CIR_AREA        PIC 9(4)V99.
       01  SEQ9_CIRCUMEFERENCE  PIC 9(4)V99.

       PROCEDURE DIVISION.
           DISPLAY "PLEASE INPUT SEQ9_DIAMETER: " WITH NO ADVANCING.
           ACCEPT SEQ9_DIAMETER.

           COMPUTE SEQ9_RADIUS = SEQ9_DIAMETER / 2.
           COMPUTE SEQ9_CIR_AREA = SEQ9_PI * SEQ9_RADIUS * SEQ9_RADIUS.
           DISPLAY "AREA: " SEQ9_CIR_AREA.

           COMPUTE SEQ9_CIRCUMEFERENCE = 2 * SEQ9_PI * SEQ9_RADIUS.
           DISPLAY "CIRCUMFERENCE: " SEQ9_CIRCUMEFERENCE.
           STOP RUN.
