      *Programmer name: Gabriel Sanchez 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUBE-AND-SQUARE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SEQ7_USER_NUMBER     PIC 9(6).
       01  SEQ7_STORE_RESULT    PIC ZZ,999.


       PROCEDURE DIVISION.
           DISPLAY "PLEASE INPUT A NUMBER: " WITH NO ADVANCING.
           ACCEPT SEQ7_USER_NUMBER.

           COMPUTE SEQ7_STORE_RESULT = 
-              SEQ7_USER_NUMBER * SEQ7_USER_NUMBER.
           DISPLAY "SQUARE: " SEQ7_STORE_RESULT.
           
           COMPUTE SEQ7_STORE_RESULT = SEQ7_USER_NUMBER 
-          * SEQ7_USER_NUMBER * SEQ7_USER_NUMBER.
           DISPLAY "CUBE: " SEQ7_STORE_RESULT.
         
           STOP RUN.
