      *Programmer name: Gabriel Sanchez 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. RECTANGLE.

       ENVIRONMENT DIVISION.
           INPUT-OUTPUT SECTION.
               FILE-CONTROL.

           SELECT SQNC8-FILE ASSIGN TO "sqnc_8.dat"
-              ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
           FD SQNC8-FILE.

       01  SEQ8_RECORD.
           05  SEQ8_RECT_WIDTH_FH          PIC 9(3).
           05  SEQ8_RECT_LENGTH_FH         PIC 9(3).
           05  SEQ8_RECT_AREA_FH           PIC ZZ9.99.
           05  SEQ8_RECT_PERIMETER_FH      PIC ZZ9.99.

       WORKING-STORAGE SECTION.
       01  SEQ8_RECT_WIDTH     PIC 9(3).
       01  SEQ8_RECT_LENGTH    PIC 9(3).
       01  SEQ8_RECT_AREA      PIC ZZ9.99.
       01  SEQ8_RECT_PERIMETER PIC ZZ9.99.

       PROCEDURE DIVISION.
           DISPLAY "PLEASE INPUT WIDTH: " WITH NO ADVANCING.
           ACCEPT SEQ8_RECT_WIDTH.

           DISPLAY "PLEASE INPUT LENGTH: " WITH NO ADVANCING.
           ACCEPT SEQ8_RECT_LENGTH.

           COMPUTE SEQ8_RECT_AREA = SEQ8_RECT_WIDTH * SEQ8_RECT_LENGTH.
           DISPLAY "AREA: " SEQ8_RECT_AREA.

           COMPUTE SEQ8_RECT_PERIMETER = 
-          2 * (SEQ8_RECT_WIDTH + SEQ8_RECT_LENGTH).
           DISPLAY "PERIMETER: " SEQ8_RECT_PERIMETER.

           OPEN EXTEND SQNC8-FILE.
               MOVE SEQ8_RECT_WIDTH TO SEQ8_RECT_WIDTH_FH.
               MOVE SEQ8_RECT_LENGTH TO SEQ8_RECT_LENGTH_FH.
               MOVE SEQ8_RECT_AREA TO SEQ8_RECT_AREA_FH.
               MOVE SEQ8_RECT_PERIMETER TO SEQ8_RECT_PERIMETER_FH

               WRITE SEQ8_RECORD.
           CLOSE SQNC8-FILE.
           
           STOP RUN.
